# 1.taks
# Напишите функцию, которая принимает целое число n и выводит на экран все числа от 1 до n (включительно).
def print_numbers(n):
    for i in range(1, n+1):
        print(i)

print_numbers(5)

# 2.taks

# 3.taks

# 4.taks

# 5.taks

# 6.taks

# 7.taks

# 8.taks

# 9.taks

# 10.taks



